<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>О Шифр Сцитала</h3>
<p>Шифр Сцитала - один из транспозиционных шифров. Сцитала в переводе с греческого означает жезл.</p>
<p>Оберните полоску пергамент вокруг палки, написав символы</p>
<p>Ключом шифрования является количество символов, которое можно записать за один раунд палки. Кроме того, вы также можете указать количество символов, которые можно написать в одной строке (количество раз, когда пергамент заворачивается).</p>

<p>Например, если количество символов, которые могут быть записаны в одном раунде полосы, равно 4 и «THIS_IS_A_SECRET_MESSAGE» зашифровано, это будет следующим.</p>

<p>1. Разместите буквы поперек пергамент. Поскольку количество символов, которые могут быть записаны за один раунд палки, равно 4, а текст, который нужно зашифровать, составляет 24 символа, мы расположим до 6 символов по горизонтали.</p>
<pre>
-----------------------------------
     | T | H | I | S | _ | I |___|
     | S | _ | A | _ | S | E |
  ___| C | R | E | T | _ | M |
 |   | E | S | S | A | G | E |
-----------------------------------
</pre>

<p>2. Он зашифрован путем отматывания пергамент с палки.</p>
<pre>TSCEH_RSIAESS_TA_S_GIEME</pre>
