<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>關於斯巴達棒 (Scytale Cipher)</h3>
<p>斯巴達棒（Scytale）密碼是一種透過重新排列文本字符來進行加密的置換密碼。Scytale 在希臘語中意為棒。</p>
<p>將一條細長的羊皮紙纏繞在棒上，橫跨羊皮紙書寫字符來進行加密。</p>
<p>棒的一周可書寫的字符數是加密金鑰。或者，也可以指定一行可書寫的字符數（羊皮紙纏繞的圈數）。</p>

<p>例如，棒的一周可書寫 4 個字符，加密「THIS_IS_A_SECRET_MESSAGE」如下。</p>

<p>1. 橫跨羊皮紙排列字符。因為棒的一周可書寫 4 個字符，加密文本為 24 個字符，所以橫向排列 6 個字符。</p>
<pre>
-----------------------------------
     | T | H | I | S | _ | I |___|
     | S | _ | A | _ | S | E |
  ___| C | R | E | T | _ | M |
 |   | E | S | S | A | G | E |
-----------------------------------
</pre>

<p>2. 從棒上解開羊皮紙即可完成加密。</p>
<pre>TSCEH_RSIAESS_TA_S_GIEME</pre>
