<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>О преобразовании символов половинной и полной ширины</h3>
<p>Преобразует символы половинной ширины и символы полной ширины друг в друга.</p>
<p>Он поддерживает буквы (A-Z), цифры (0-9), символы, японскую катакану и корейский корейский.</p>

<p>Например, результат преобразования символа половинной ширины «Hello, world!» В символ полной ширины выглядит следующим образом.</p>

<pre>Ｈｅｌｌｏ，　ｗｏｒｌｄ！</pre>

<p>Кроме того, результат преобразования японского «サンプル» катаканы полной ширины в катакану половинной ширины выглядит следующим образом. Точка помутнения (゛) и точка полумутности (゜) преобразуются в один символ полуширины.</p>

<pre>ｻﾝﾌﾟﾙ</pre>
