<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>О японской эре</h3>
<p>Японская эра - это японский формат записи даты и времени.</p>
<p>Год представлен эрой и числом последующих лет. Первый год пишется как «元年» вместо «1 年».</p>
<p>DenCode соответствует японской эпохе после 1868 года (название эпохи: Мэйдзи).</p>

<p>Например, если вы конвертируете 23 января 2000 года 1: 23: 45.678 (JST) в японскую эру, вы получите следующий результат.</p>

<pre>平成12年01月03日01時23分45.678秒 JST</pre>
