<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>关于栅栏密码 (Rail Fence Cipher)</h3>
<p>栅栏密码是一种通过重新排列文本字符来进行加密的置换密码。</p>
<p>Rail Fence 意为栅栏（横木），通过将字符呈之字形排列在栅栏上，最后按栅栏（行）读取字符并连接起来进行加密。</p>
<p>栅栏的数量（行数）是加密密钥。</p>

<p>例如，使用 4 行栅栏加密“THIS_IS_A_SECRET_MESSAGE”如下。</p>

<p>1. 准备 4 行栅栏（高度为 4），从左上角开始呈之字形排列字符。</p>
<pre>
-----------------------------------------------
T           S           C           E          
-----------------------------------------------
  H       I   _       E   R       M   S       E
-----------------------------------------------
    I   _       A   S       E   _       S   G  
-----------------------------------------------
      S           _           T           A    
-----------------------------------------------
</pre>

<p>2. 按行获取排列好的字符。</p>
<pre>
TSCE
HI_ERMSE
I_ASE_SG
S_TA
</pre>

<p>3. 连接各行的字符。</p>
<pre>TSCEHI_ERMSEI_ASE_SGS_TA</pre>
