<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>关于阿特巴希密码 (Atbash Cipher)</h3>
<p>阿特巴希密码是一种通过替换文本中的字符来进行加密的单表代换密码。</p>
<p>字符的替换是通过将字符列表逆序映射来进行的。</p>
<p>例如，对于“ABCDEFGHIJKLMNOPQRSTUVWXYZ”这些英文字母，“A”加密为“Z”，“B”加密为“Y”。</p>

<pre>
加密前 : ABCDEFGHIJKLMNOPQRSTUVWXYZ
加密后 : ZYXWVUTSRQPONMLKJIHGFEDCBA
</pre>

<pre>
加密前的文章 (明文) : THIS IS A SECRET MESSAGE
加密后的文章 (密文) : GSRH RH Z HVXIVG NVHHZTV
</pre>

<p>原本是用作希伯来语的加密。希伯来语的加密如下。</p>

<pre>
加密前 : אבגדהוזחטיכלמנסעפצקרשת
加密后 : תשרקצפעסנמלכיטחזוהדגבא
</pre>

<p>由于具有将密文再次加密即可获得明文的反转性，因此可以用与加密相同的流程进行解密。</p>


<h4>其他语言支持</h4>
<p>除了拉丁字母和希伯来语，还支持西里尔字母和日语的平假名/片假名。</p>

<h5>西里尔字母</h5>
<pre>
加密前 : АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ
加密后 : ЯЮЭЬЫЪЩШЧЦХФУТСРПОНМЛКЙИЗЖЕДГВБА
</pre>

<h5>日语平假名/片假名</h5>
<pre>
加密前 : ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔ
加密后 : ゔんをゑゐわゎろれるりらよょゆゅやゃもめむみまぽぼほぺべへぷぶふぴびひぱばはのねぬになどとでてづつっぢちだたぞそぜせずすじしざさごこげけぐくぎきがかおぉえぇうぅいぃあぁ
</pre>

<pre>
加密前 : ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴ
加密后 : ヴンヲヱヰワヮロレルリラヨョユュヤャモメムミマポボホペベヘプブフピビヒパバハノネヌニナドトデテヅツッヂチダタゾソゼセズスジシザサゴコゲケグクギキガカオォエェウゥイィアァ
</pre>

<p>字符顺序遵循 Unicode 定义。“ゕ”“ゖ”“ヵ”“ヶ”以及“ヷ”“ヸ”“ヹ”“ヺ”不属于加密对象，请注意。</p>
