<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>關於凱撒密碼 (Caesar Cipher)</h3>
<p>凱撒密碼是一種透過替換文本中的字符來進行加密的單表代換密碼。</p>
<p>字符的替換是透過將「A」到「Z」的字符在「ABCDEFGHIJKLMNOPQRSTUVWXYZ」這 26 個字符中移動來進行的。</p>
<p>例如，移動 -3 個字符時，「A」被加密為「X」，「Z」被加密為「W」。</p>

<pre>
加密前 : ABCDEFGHIJKLMNOPQRSTUVWXYZ
加密後 : XYZABCDEFGHIJKLMNOPQRSTUVW
</pre>

<pre>
加密前的文章 : THIS IS A SECRET MESSAGE
加密後的文章 : QEFP FP X PBZOBQ JBPPXDB
</pre>

<p>移動的數量是加密的金鑰。</p>
<p>僅加密英文字母，數字和符號等不進行加密。</p>
<p>如果移動數量為 13，結果將與 <a href="rot13">ROT13</a> 相同。</p>

<p>字符在保留變音符號的狀態下移動。因此，例如「Á」將被加密為「X́」。</p>


<h4>其他語言支援</h4>
<p>除了拉丁字母，還支援西里爾字母和日語的平假名/片假名。</p>

<h5>西里爾字母</h5>
<p>移動 -3 個西里爾字母時的加密結果如下。</p>

<pre>
加密前 : АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ
加密後 : ЭЮЯАБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬ
</pre>

<p>字符在保留變音符號的狀態下移動。因此，例如俄語的「Ё」將被加密為「В̈」。「Й」和「й」被視為單獨的一個字符，而不是帶有變音符號「 ̆」(Breve)的「И」「и」。</p>

<h5>日語平假名/片假名</h5>
<p>移動 -3 個日語平假名/片假名時的加密結果如下。</p>

<pre>
加密前 : ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑをんゔ
加密後 : をんゔぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろゎわゐゑ
</pre>

<pre>
加密前 : ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱヲンヴ
加密後 : ヲンヴァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロヮワヰヱ
</pre>

<p>字符順序遵循 Unicode 定義。「ゕ」「ゖ」「ヵ」「ヶ」以及「ヷ」「ヸ」「ヹ」「ヺ」不屬於加密對象，請注意。</p>
