<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>关于斯巴达棒 (Scytale Cipher)</h3>
<p>斯巴达棒（Scytale）密码是一种通过重新排列文本字符来进行加密的置换密码。Scytale 在希腊语中意为棒。</p>
<p>将一条细长的羊皮纸缠绕在棒上，横跨羊皮纸书写字符来进行加密。</p>
<p>棒的一周可书写的字符数是加密密钥。或者，也可以指定一行可书写的字符数（羊皮纸缠绕的圈数）。</p>

<p>例如，棒的一周可书写 4 个字符，加密“THIS_IS_A_SECRET_MESSAGE”如下。</p>

<p>1. 横跨羊皮纸排列字符。因为棒的一周可书写 4 个字符，加密文本为 24 个字符，所以横向排列 6 个字符。</p>
<pre>
-----------------------------------
     | T | H | I | S | _ | I |___|
     | S | _ | A | _ | S | E |
  ___| C | R | E | T | _ | M |
 |   | E | S | S | A | G | E |
-----------------------------------
</pre>

<p>2. 从棒上解开羊皮纸即可完成加密。</p>
<pre>TSCEH_RSIAESS_TA_S_GIEME</pre>
