<%@ page contentType="text/html; charset=UTF-8" pageEncoding="UTF-8"
%><h3>Анализ доступа</h3>
<p>Этот сайт использует службу анализа доступа (Google Analytics).</p>
<p>Эти службы анализа доступа используют файлы cookie для сбора данных о трафике.</p>
<p>Для получения дополнительной информации, пожалуйста, нажмите <a href="https://policies.google.com/technologies/partner-sites?hl=ru" target="_blank">Как Google обрабатывает информацию, которая поступает от сайтов и приложений, использующих наши сервисы – Политика конфиденциальности и Условия использования – Google</a>.</p>

<h3>Реклама</h3>
<p>Этот сайт использует рекламную службу (Google AdSense) для размещения на сайте рекламы, распространяемой третьими сторонами.</p>
<p>Эти рекламные службы используют файлы cookie для показа рекламы продуктов и услуг, которые вас интересуют.</p>
<p>Для получения дополнительной информации, пожалуйста, нажмите <a href="https://policies.google.com/technologies/ads?hl=ru" target="_blank">Реклама – Политика конфиденциальности и Условия использования – Google</a>.</p>
